; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
(define (problem blocksworld-69)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 - object)
 (:init 
    (arm-empty)
    (clear b16)
    (on b16 b9)
    (on-table b9)
    (clear b2)
    (on b2 b5)
    (on b5 b8)
    (on b8 b10)
    (on b10 b19)
    (on b19 b15)
    (on b15 b17)
    (on b17 b3)
    (on b3 b20)
    (on b20 b1)
    (on b1 b18)
    (on b18 b6)
    (on-table b6)
    (clear b14)
    (on b14 b4)
    (on-table b4)
    (clear b7)
    (on b7 b13)
    (on b13 b11)
    (on b11 b12)
    (on-table b12))
 (:goal (and 
(clear b15) (on b15 b18)
))
)

; plan
1. (unstack b2 b5)
   deleted: (on b2 b5) (clear b2) (arm-empty)
   added: (holding b2) (clear b5)
   goals met: 0 of 2
2. (putdown b2)
   deleted: (holding b2)
   added: (clear b2) (arm-empty) (on-table b2)
   goals met: 0 of 2
3. (unstack b5 b8)
   deleted: (on b5 b8) (clear b5) (arm-empty)
   added: (holding b5) (clear b8)
   goals met: 0 of 2
4. (putdown b5)
   deleted: (holding b5)
   added: (clear b5) (arm-empty) (on-table b5)
   goals met: 0 of 2
5. (unstack b8 b10)
   deleted: (on b8 b10) (clear b8) (arm-empty)
   added: (holding b8) (clear b10)
   goals met: 0 of 2
6. (putdown b8)
   deleted: (holding b8)
   added: (clear b8) (arm-empty) (on-table b8)
   goals met: 0 of 2
7. (unstack b10 b19)
   deleted: (on b10 b19) (clear b10) (arm-empty)
   added: (holding b10) (clear b19)
   goals met: 0 of 2
8. (putdown b10)
   deleted: (holding b10)
   added: (clear b10) (arm-empty) (on-table b10)
   goals met: 0 of 2
9. (unstack b19 b15)
   deleted: (on b19 b15) (clear b19) (arm-empty)
   added: (holding b19) (clear b15)
   goals met: 1 of 2
10. (putdown b19)
   deleted: (holding b19)
   added: (clear b19) (arm-empty) (on-table b19)
   goals met: 1 of 2
11. (unstack b15 b17)
   deleted: (on b15 b17) (clear b15) (arm-empty)
   added: (holding b15) (clear b17)
   goals met: 0 of 2
12. (stack b15 b10)
   deleted: (clear b10) (holding b15)
   added: (arm-empty) (clear b15) (on b15 b10)
   goals met: 1 of 2
13. (unstack b17 b3)
   deleted: (on b17 b3) (clear b17) (arm-empty)
   added: (holding b17) (clear b3)
   goals met: 1 of 2
14. (putdown b17)
   deleted: (holding b17)
   added: (clear b17) (arm-empty) (on-table b17)
   goals met: 1 of 2
15. (unstack b3 b20)
   deleted: (on b3 b20) (clear b3) (arm-empty)
   added: (holding b3) (clear b20)
   goals met: 1 of 2
16. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 1 of 2
17. (unstack b20 b1)
   deleted: (on b20 b1) (clear b20) (arm-empty)
   added: (holding b20) (clear b1)
   goals met: 1 of 2
18. (putdown b20)
   deleted: (holding b20)
   added: (clear b20) (arm-empty) (on-table b20)
   goals met: 1 of 2
19. (unstack b1 b18)
   deleted: (on b1 b18) (clear b1) (arm-empty)
   added: (holding b1) (clear b18)
   goals met: 1 of 2
20. (putdown b1)
   deleted: (holding b1)
   added: (clear b1) (arm-empty) (on-table b1)
   goals met: 1 of 2
21. (unstack b15 b10)
   deleted: (on b15 b10) (clear b15) (arm-empty)
   added: (holding b15) (clear b10)
   goals met: 0 of 2
22. (stack b15 b18)
   deleted: (clear b18) (holding b15)
   added: (arm-empty) (clear b15) (on b15 b18)
   goals met: 2 of 2
